Repository: SAP/fundamental
Catalog: src/locale/messages.*.xlf
Languages: bg, fr

source: Fundamental Styles simplifies building consistent SAP Fiori apps in any web-based technology (Angular, Vue, React, etc.). It offers designed and pre-built components for easy implementation and is open-source and community-driven.
bg: Fundamental Styles опростява изграждането на последователни приложения SAP Fiori във всяка уеб базирана технология (Angular, Vue, React и др.). Тя предлага проектирани и предварително изградени компоненти за лесно внедряване и е с отворен код и управляван от общността.
fr: Fundamental Styles simplifie la création d'applications SAP Fiori cohérentes dans n'importe quelle technologie basée sur le Web (Angular, Vue, React, etc.). Il propose des composants conçus et prédéfinis pour une mise en œuvre facile et demeure open source et piloté par la communauté.

source: The Fundamental NGX library is based on the Angular framework and Fundamental Styles, giving its components a modern look. It offers already built and ready-to-use components which reduce drastically the overall coding time and lines for the developer.
bg: Библиотеката Fundamental NGX е базирана на Angular framework и Fundamental Styles, придавайки на нейните компоненти модерен вид. Тя предлага вече изградени и готови за използване компоненти, които драстично намаляват общото време за кодиране и размера за разработчика.
fr: La bibliothèque Fundamental NGX est basée sur le framework Angular et Fundamental Styles, donnant à ses composants un aspect moderne. Il propose des composants déjà construits et prêts à l'emploi qui réduisent considérablement le temps de codage pour le développeur.

source: documentation
bg: документация

source: Connect with the Fundamentals community through our annual conference featuring insightful sessions by industry professionals using and collaborating with the Fundamental Libraries in their work.
bg: Свържете се с общността на Fundamentals чрез нашата годишна конференция, включваща сесии от професионалисти в индустрията, които използват и си сътрудничат с Fundamental Libraries в работата си.
fr: Connectez-vous avec la communauté Fundamentals grâce à notre conférence annuelle proposant des sessions instructives animées par des professionnels de l'industrie utilisant et collaborant avec les bibliothèques fondamentales dans leur travail.

source: see past events
bg: виж минали събития
fr: voir les événements précédents

source: Fundamental Libraries follow the SAP Design guidelines for all component libraries and layout configurations to bring full alignment with an industry standard visual language.
bg: Основните библиотеки следват указанията за дизайн на SAP за всички компоненти библиотеки и конфигурации на оформление, за да осигурят пълно привеждане в съответствие с индустриалния стандартен визуален език.
fr: Les bibliothèques fondamentales suivent les directives de Design SAP pour toutes les bibliothèques de composantes et configurations de mise en page afin d'assurer un alignement complet avec un langage visuel standard de l'industrie.

source: explore
bg: изследвай
fr: explorer

source: Fundamental Library is a robust open-source toolkit allowing seamless alignment of application interfaces with the signature SAP Design theming and versatility.
bg: Fundamental Library е стабилен инструментариум с отворен код, позволяващ безпроблемно привеждане в съответствие на интерфейсите на приложенията с характерната тематика и гъвкавост на SAP Design.
fr: Fundamental Library est une boîte à outils open source permettant un alignement simple des interfaces d'application avec la thématique et la polyvalence signature de SAP Design.

source: browse libraries
bg: разгледай библиотеките
fr: parcourir les bibliothèques

source: discover testimonials
bg: открий препоръки
fr: découvrez les témoignages

source: Purpose
bg: Предназначение
fr: Notre But

source: Fundamental library grew out of a need to ensure a consistent SAP Fiori look and feel across products and applications without having to rebuild them from the ground up.
bg: Fundamental library израсна от необходимостта да се осигури последователен външен вид и усещане на SAP Design в продуктите и приложенията, без да се налага да ги пренаписвате от самото начало.
fr: La bibliothèque fondamentale est née du besoin de garantir une apparence SAP Fiori cohérente entre les produits et les applications sans avoir à les reconstruire à partir de zéro.

source: Used by
bg: Използвани от
fr: Utilisées par

source: Many
bg: Много
fr: Beaucoup

source: SAP Design System
fr: Système de Design SAP
